MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.h
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_xspi.h
  * @brief   Header file of XSPI HAL module.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32C5XX_HAL_XSPI_H
#define STM32C5XX_HAL_XSPI_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32c5xx_hal_def.h"

#if defined(XSPI1)

#include "stm32c5xx_dlyb_core.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

/** @defgroup XSPI XSPI
  * @{
  */

/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup XSPI_Exported_Constants HAL XSPI Constants
  * @{
  */


/** @defgroup XSPI_Flag Flags
  * @{
  */
#define HAL_XSPI_FLAG_BUSY XSPI_SR_BUSY                                                        /*!< Busy flag: operation is ongoing                                                                          */
#define HAL_XSPI_FLAG_TO   XSPI_SR_TOF                                                         /*!< Timeout flag: timeout occurs in memory-mapped mode                                                       */
#if defined(XSPI_SR_SMF)
#define HAL_XSPI_FLAG_SM   XSPI_SR_SMF                                                         /*!< Status match flag: received data matches in auto-polling mode                                            */
#endif /* XSPI_SR_SMF */
#define HAL_XSPI_FLAG_FT   XSPI_SR_FTF                                                         /*!< FIFO threshold flag: FIFO threshold reached or data left after read from memory is complete              */
#define HAL_XSPI_FLAG_TC   XSPI_SR_TCF                                                         /*!< Transfer complete flag: programmed number of data have been transferred or the transfer has been aborted */
#define HAL_XSPI_FLAG_TE   XSPI_SR_TEF                                                         /*!< Transfer error flag: invalid address is being accessed                                                   */
#if defined(XSPI_SR_SMF)
#define HAL_XSPI_FLAG_ALL  XSPI_SR_TOF | XSPI_SR_SMF | XSPI_SR_FTF | XSPI_SR_TCF | XSPI_SR_TEF /*!< All flags                                                                                                */
#else
#define HAL_XSPI_FLAG_ALL  XSPI_SR_TOF | XSPI_SR_FTF | XSPI_SR_TCF | XSPI_SR_TEF               /*!< All flags                                                                                                */
#endif /* XSPI_SR_SMF */
/**
  * @}
  */

/** @defgroup XSPI_Interrupts Interrupts
  * @{
  */
#define HAL_XSPI_IT_TO  XSPI_CR_TOIE                                                             /*!< Interrupt on the timeout flag           */
#define HAL_XSPI_IT_SM  XSPI_CR_SMIE                                                             /*!< Interrupt on the status match flag      */
#define HAL_XSPI_IT_FT  XSPI_CR_FTIE                                                             /*!< Interrupt on the FIFO threshold flag    */
#define HAL_XSPI_IT_TC  XSPI_CR_TCIE                                                             /*!< Interrupt on the transfer complete flag */
#define HAL_XSPI_IT_TE  XSPI_CR_TEIE                                                             /*!< Interrupt on the transfer error flag    */
#if defined(XSPI_SR_SMF)
#define HAL_XSPI_IT_ALL XSPI_CR_TOIE | XSPI_CR_SMIE | XSPI_CR_FTIE | XSPI_CR_TCIE | XSPI_CR_TEIE /*!< All interrupts                          */
#else
#define HAL_XSPI_IT_ALL XSPI_CR_TOIE | XSPI_CR_FTIE | XSPI_CR_TCIE | XSPI_CR_TEIE /*!< All interrupts                          */
#endif /* XSPI_SR_SMF */
/**
  * @}
  */

/** @defgroup XSPI_Optional_Interrupt Optional interrupts
  * @{
  */
#define HAL_XSPI_OPT_IT_NONE    HAL_DMA_OPT_IT_NONE    /*!< DMA channel optional interrupts disabled    */
#define HAL_XSPI_OPT_IT_HT      HAL_DMA_OPT_IT_HT      /*!< DMA channel half transfer interrupt enabled */
#define HAL_XSPI_OPT_IT_DEFAULT HAL_DMA_OPT_IT_DEFAULT /*!< DMA channel all optional interrupts enabled */
/**
  * @}
  */

/** @defgroup XSPI_Error_Code Error Code definition reflecting the processes asynchronous errors
  * @{
  */
#if (defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U))
#define HAL_XSPI_ERROR_NONE      (0x00UL << 0U) /*!< XSPI error none     */
#define HAL_XSPI_ERROR_TRANSFER  (0x01UL << 0U) /*!< XSPI transfer error */
#define HAL_XSPI_ERROR_TIMEOUT   (0x01UL << 2U) /*!< XSPI timeout error  */
#if defined(USE_HAL_XSPI_DMA) && (USE_HAL_XSPI_DMA == 1U)
#define HAL_XSPI_ERROR_DMA       (0x01UL << 1U) /*!< DMA transfer error  */
#endif /* USE_HAL_XSPI_DMA */
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */
/**
  * @}
  */

/**
  * @}
  */

/* Exported types ----------------------------------------------------------------------------------------------------*/

/** @defgroup XSPI_Exported_Types HAL XSPI Types
  * @{
  */

/**
  * @brief HAL XSPI instance enumeration definition.
  */
typedef enum
{
  HAL_XSPI1    = XSPI1_R_BASE,    /*!< HAL XSPI instance 1 */
} hal_xspi_t;

/**
  * @brief HAL XSPI state enumeration definition.
  */
typedef enum
{
  HAL_XSPI_STATE_RESET                = 0U,           /*!< Reset state                                  */
  HAL_XSPI_STATE_INIT                 = (1U  << 31U), /*!< XSPI is initialized but not yet configured   */
  HAL_XSPI_STATE_IDLE                 = (1U  << 30U), /*!< XSPI initialized and a global config applied */
  HAL_XSPI_STATE_CMD_ACTIVE           = (1U  << 29U), /*!< Command ongoing                              */
  HAL_XSPI_STATE_AUTO_POLLING_ACTIVE  = (1U  << 28U), /*!< Auto-polling ongoing                         */
  HAL_XSPI_STATE_TX_ACTIVE            = (1U  << 27U), /*!< Indirect Tx ongoing                          */
  HAL_XSPI_STATE_RX_ACTIVE            = (1U  << 26U), /*!< Indirect Rx ongoing                          */
  HAL_XSPI_STATE_MEMORY_MAPPED_ACTIVE = (1U  << 25U), /*!< Memory-mapped ongoing                        */
  HAL_XSPI_STATE_ABORT                = (1U  << 24U), /*!< Abort ongoing                                */
} hal_xspi_state_t;

/**
  * @brief HAL XSPI DLYB State enumeration definition.
  */
typedef enum
{
  HAL_XSPI_DLYB_DISABLED = DLYB_DISABLED, /*!< XSPI DLYB disabled */
  HAL_XSPI_DLYB_ENABLED  = DLYB_ENABLED   /*!< XSPI DLYB enabled  */
} hal_xspi_dlyb_status_t;

/**
  * @brief HAL XSPI flag state enumeration definition.
  */
typedef enum
{
  HAL_XSPI_FLAG_NOT_ACTIVE = 0U,      /*!< Flag not active */
  HAL_XSPI_FLAG_ACTIVE                /*!< Flag active     */
} hal_xspi_flag_status_t;

/**
  * @brief HAL XSPI Memory Mode enumeration definition.
  */
typedef enum
{
  HAL_XSPI_MEMORY_SINGLE = 0U,          /*!< Dual memory mode disabled */
  HAL_XSPI_MEMORY_DUAL   = XSPI_CR_DMM  /*!< Dual memory mode enabled  */
} hal_xspi_memory_mode_t;

/**
  * @brief HAL XSPI Memory Type enumeration definition.
  */
typedef enum
{
  HAL_XSPI_MEMORY_TYPE_MICRON       = 0U,                                    /*!< Micron mode       */
  HAL_XSPI_MEMORY_TYPE_MACRONIX     = XSPI_DCR1_MTYP_0,                      /*!< Macronix mode     */
  HAL_XSPI_MEMORY_TYPE_APMEM        = XSPI_DCR1_MTYP_1,                      /*!< AP Memory mode    */
  HAL_XSPI_MEMORY_TYPE_MACRONIX_RAM = (XSPI_DCR1_MTYP_1 | XSPI_DCR1_MTYP_0), /*!< Macronix RAM mode */
#if defined(XSPI_DCR1_MTYP_2)
  HAL_XSPI_MEMORY_TYPE_HYPERBUS     = XSPI_DCR1_MTYP_2,                      /*!< Hyperbus mode     */
#endif /* XSPI_DCR1_MTYP_2 */
} hal_xspi_memory_type_t;

/**
  * @brief HAL XSPI Memory Size enumeration definition.
  */
typedef enum
{
  HAL_XSPI_MEMORY_SIZE_16BIT   = (0x00U << XSPI_DCR1_DEVSIZE_Pos), /*!<  16 bits  (  2  Bytes = 2^( 0+1)) */
  HAL_XSPI_MEMORY_SIZE_32BIT   = (0x01U << XSPI_DCR1_DEVSIZE_Pos), /*!<  32 bits  (  4  Bytes = 2^( 1+1)) */
  HAL_XSPI_MEMORY_SIZE_64BIT   = (0x02U << XSPI_DCR1_DEVSIZE_Pos), /*!<  64 bits  (  8  Bytes = 2^( 2+1)) */
  HAL_XSPI_MEMORY_SIZE_128BIT  = (0x03U << XSPI_DCR1_DEVSIZE_Pos), /*!< 128 bits  ( 16  Bytes = 2^( 3+1)) */
  HAL_XSPI_MEMORY_SIZE_256BIT  = (0x04U << XSPI_DCR1_DEVSIZE_Pos), /*!< 256 bits  ( 32  Bytes = 2^( 4+1)) */
  HAL_XSPI_MEMORY_SIZE_512BIT  = (0x05U << XSPI_DCR1_DEVSIZE_Pos), /*!< 512 bits  ( 64  Bytes = 2^( 5+1)) */
  HAL_XSPI_MEMORY_SIZE_1KBIT   = (0x06U << XSPI_DCR1_DEVSIZE_Pos), /*!<   1 Kbits (128  Bytes = 2^( 6+1)) */
  HAL_XSPI_MEMORY_SIZE_2KBIT   = (0x07U << XSPI_DCR1_DEVSIZE_Pos), /*!<   2 Kbits (256  Bytes = 2^( 7+1)) */
  HAL_XSPI_MEMORY_SIZE_4KBIT   = (0x08U << XSPI_DCR1_DEVSIZE_Pos), /*!<   4 Kbits (512  Bytes = 2^( 8+1)) */
  HAL_XSPI_MEMORY_SIZE_8KBIT   = (0x09U << XSPI_DCR1_DEVSIZE_Pos), /*!<   8 Kbits (  1 KBytes = 2^( 9+1)) */
  HAL_XSPI_MEMORY_SIZE_16KBIT  = (0x0AU << XSPI_DCR1_DEVSIZE_Pos), /*!<  16 Kbits (  2 KBytes = 2^(10+1)) */
  HAL_XSPI_MEMORY_SIZE_32KBIT  = (0x0BU << XSPI_DCR1_DEVSIZE_Pos), /*!<  32 Kbits (  4 KBytes = 2^(11+1)) */
  HAL_XSPI_MEMORY_SIZE_64KBIT  = (0x0CU << XSPI_DCR1_DEVSIZE_Pos), /*!<  64 Kbits (  8 KBytes = 2^(12+1)) */
  HAL_XSPI_MEMORY_SIZE_128KBIT = (0x0DU << XSPI_DCR1_DEVSIZE_Pos), /*!< 128 Kbits ( 16 KBytes = 2^(13+1)) */
  HAL_XSPI_MEMORY_SIZE_256KBIT = (0x0EU << XSPI_DCR1_DEVSIZE_Pos), /*!< 256 Kbits ( 32 KBytes = 2^(14+1)) */
  HAL_XSPI_MEMORY_SIZE_512KBIT = (0x0FU << XSPI_DCR1_DEVSIZE_Pos), /*!< 512 Kbits ( 64 KBytes = 2^(15+1)) */
  HAL_XSPI_MEMORY_SIZE_1MBIT   = (0x10U << XSPI_DCR1_DEVSIZE_Pos), /*!<   1 Mbits (128 KBytes = 2^(16+1)) */
  HAL_XSPI_MEMORY_SIZE_2MBIT   = (0x11U << XSPI_DCR1_DEVSIZE_Pos), /*!<   2 Mbits (256 KBytes = 2^(17+1)) */
  HAL_XSPI_MEMORY_SIZE_4MBIT   = (0x12U << XSPI_DCR1_DEVSIZE_Pos), /*!<   4 Mbits (512 KBytes = 2^(18+1)) */
  HAL_XSPI_MEMORY_SIZE_8MBIT   = (0x13U << XSPI_DCR1_DEVSIZE_Pos), /*!<   8 Mbits (  1 MBytes = 2^(19+1)) */
  HAL_XSPI_MEMORY_SIZE_16MBIT  = (0x14U << XSPI_DCR1_DEVSIZE_Pos), /*!<  16 Mbits (  2 MBytes = 2^(20+1)) */
  HAL_XSPI_MEMORY_SIZE_32MBIT  = (0x15U << XSPI_DCR1_DEVSIZE_Pos), /*!<  32 Mbits (  4 MBytes = 2^(21+1)) */
  HAL_XSPI_MEMORY_SIZE_64MBIT  = (0x16U << XSPI_DCR1_DEVSIZE_Pos), /*!<  64 Mbits (  8 MBytes = 2^(22+1)) */
  HAL_XSPI_MEMORY_SIZE_128MBIT = (0x17U << XSPI_DCR1_DEVSIZE_Pos), /*!< 128 Mbits ( 16 MBytes = 2^(23+1)) */
  HAL_XSPI_MEMORY_SIZE_256MBIT = (0x18U << XSPI_DCR1_DEVSIZE_Pos), /*!< 256 Mbits ( 32 MBytes = 2^(24+1)) */
  HAL_XSPI_MEMORY_SIZE_512MBIT = (0x19U << XSPI_DCR1_DEVSIZE_Pos), /*!< 512 Mbits ( 64 MBytes = 2^(25+1)) */
  HAL_XSPI_MEMORY_SIZE_1GBIT   = (0x1AU << XSPI_DCR1_DEVSIZE_Pos), /*!<   1 Gbits (128 MBytes = 2^(26+1)) */
  HAL_XSPI_MEMORY_SIZE_2GBIT   = (0x1BU << XSPI_DCR1_DEVSIZE_Pos), /*!<   2 Gbits (256 MBytes = 2^(27+1)) */
  HAL_XSPI_MEMORY_SIZE_4GBIT   = (0x1CU << XSPI_DCR1_DEVSIZE_Pos), /*!<   4 Gbits (512 MBytes = 2^(28+1)) */
  HAL_XSPI_MEMORY_SIZE_8GBIT   = (0x1DU << XSPI_DCR1_DEVSIZE_Pos), /*!<   8 Gbits (  1 GBytes = 2^(29+1)) */
  HAL_XSPI_MEMORY_SIZE_16GBIT  = (0x1EU << XSPI_DCR1_DEVSIZE_Pos), /*!<  16 Gbits (  2 GBytes = 2^(30+1)) */
  HAL_XSPI_MEMORY_SIZE_32GBIT  = (0x1FU << XSPI_DCR1_DEVSIZE_Pos)  /*!<  32 Gbits (  4 GBytes = 2^(31+1)) */
} hal_xspi_memory_size_t;

/**
  * @brief HAL XSPI Free Running Clock enumeration definition.
  */
typedef enum
{
  HAL_XSPI_FREE_RUNNING_CLK_DISABLED = 0U,            /*!< CLK is not free running          */
  HAL_XSPI_FREE_RUNNING_CLK_ENABLED  = XSPI_DCR1_FRCK /*!< CLK is always provided (running) */
} hal_xspi_free_running_clk_status_t;

/**
  * @brief HAL XSPI Prefetch Data enumeration definition.
  */
typedef enum
{
  HAL_XSPI_PREFETCH_DATA_ENABLED  = 0U,             /*!< Automatic prefetch for data is enabled */
  HAL_XSPI_PREFETCH_DATA_DISABLED = XSPI_CR_NOPREF  /*!< Automatic prefetch disabled            */
} hal_xspi_prefetch_data_status_t;


#if defined(XSPI_DCR2_WRAPSIZE)
/**
  * @brief HAL XSPI Wrap Size enumeration definition.
  */
typedef enum
{
  HAL_XSPI_WRAP_NOT_SUPPORTED = 0U,                                            /*!< wrapped reads are not supported by the memory   */
  HAL_XSPI_WRAP_16BYTE        = XSPI_DCR2_WRAPSIZE_1,                          /*!< external memory supports wrap size of 16 bytes  */
  HAL_XSPI_WRAP_32BYTE        = (XSPI_DCR2_WRAPSIZE_0 | XSPI_DCR2_WRAPSIZE_1), /*!< external memory supports wrap size of 32 bytes  */
  HAL_XSPI_WRAP_64BYTE        = XSPI_DCR2_WRAPSIZE_2,                          /*!< external memory supports wrap size of 64 bytes  */
  HAL_XSPI_WRAP_128BYTE       = (XSPI_DCR2_WRAPSIZE_0 | XSPI_DCR2_WRAPSIZE_2)  /*!< external memory supports wrap size of 128 bytes */
} hal_xspi_wrap_size_t;
#endif /* XSPI_DCR2_WRAPSIZE */

/**
  * @brief HAL XSPI Sample Shift enumeration definition.
  */
typedef enum
{
  HAL_XSPI_SAMPLE_SHIFT_NONE      = 0U,             /*!< No shift        */
  HAL_XSPI_SAMPLE_SHIFT_HALFCYCLE = XSPI_TCR_SSHIFT /*!< 1/2 cycle shift */
} hal_xspi_sample_shift_t;

/**
  * @brief HAL XSPI Delay Hold Quarter Cycle enumeration definition.
  */
typedef enum
{
  HAL_XSPI_DELAY_HOLD_NONE       = 0U,           /*!< No Delay             */
  HAL_XSPI_DELAY_HOLD_QUARTCYCLE = XSPI_TCR_DHQC /*!< Delay Hold 1/4 cycle */
} hal_xspi_delay_hold_t;

#if defined(XSPI_DCR3_CSBOUND)
/**
  * @brief HAL XSPI Chip Select Boundary enumeration definition.
  */
typedef enum
{
  HAL_XSPI_CS_BOUNDARY_NONE    = 0x00U, /*!< CS boundary disabled           */
  HAL_XSPI_CS_BOUNDARY_16BIT   = 0x01U, /*!<  16 bits  (  2  Bytes = 2^(1))  */
  HAL_XSPI_CS_BOUNDARY_32BIT   = 0x02U, /*!<  32 bits  (  4  Bytes = 2^(2))  */
  HAL_XSPI_CS_BOUNDARY_64BIT   = 0x03U, /*!<  64 bits  (  8  Bytes = 2^(3))  */
  HAL_XSPI_CS_BOUNDARY_128BIT  = 0x04U, /*!< 128 bits  ( 16  Bytes = 2^(4))  */
  HAL_XSPI_CS_BOUNDARY_256BIT  = 0x05U, /*!< 256 bits  ( 32  Bytes = 2^(5))  */
  HAL_XSPI_CS_BOUNDARY_512BIT  = 0x06U, /*!< 512 bits  ( 64  Bytes = 2^(6))  */
  HAL_XSPI_CS_BOUNDARY_1KBIT   = 0x07U, /*!<   1 Kbits (128  Bytes = 2^(7))  */
  HAL_XSPI_CS_BOUNDARY_2KBIT   = 0x08U, /*!<   2 Kbits (256  Bytes = 2^(8))  */
  HAL_XSPI_CS_BOUNDARY_4KBIT   = 0x09U, /*!<   4 Kbits (512  Bytes = 2^(9))  */
  HAL_XSPI_CS_BOUNDARY_8KBIT   = 0x0AU, /*!<   8 Kbits (  1 KBytes = 2^(10)) */
  HAL_XSPI_CS_BOUNDARY_16KBIT  = 0x0BU, /*!<  16 Kbits (  2 KBytes = 2^(11)) */
  HAL_XSPI_CS_BOUNDARY_32KBIT  = 0x0CU, /*!<  32 Kbits (  4 KBytes = 2^(12)) */
  HAL_XSPI_CS_BOUNDARY_64KBIT  = 0x0DU, /*!< 64 Kbits  (  8 KBytes = 2^(13)) */
  HAL_XSPI_CS_BOUNDARY_128KBIT = 0x0EU, /*!< 128 Kbits ( 16 KBytes = 2^(14)) */
  HAL_XSPI_CS_BOUNDARY_256KBIT = 0x0FU, /*!< 256 Kbits ( 32 KBytes = 2^(15)) */
  HAL_XSPI_CS_BOUNDARY_512KBIT = 0x10U, /*!< 512 Kbits ( 64 KBytes = 2^(16)) */
  HAL_XSPI_CS_BOUNDARY_1MBIT   = 0x11U, /*!<   1 Mbits (128 KBytes = 2^(17)) */
  HAL_XSPI_CS_BOUNDARY_2MBIT   = 0x12U, /*!<   2 Mbits (256 KBytes = 2^(18)) */
  HAL_XSPI_CS_BOUNDARY_4MBIT   = 0x13U, /*!<   4 Mbits (512 KBytes = 2^(19)) */
  HAL_XSPI_CS_BOUNDARY_8MBIT   = 0x14U, /*!<   8 Mbits (  1 MBytes = 2^(20)) */
  HAL_XSPI_CS_BOUNDARY_16MBIT  = 0x15U, /*!<  16 Mbits (  2 MBytes = 2^(21)) */
  HAL_XSPI_CS_BOUNDARY_32MBIT  = 0x16U, /*!<  32 Mbits (  4 MBytes = 2^(22)) */
  HAL_XSPI_CS_BOUNDARY_64MBIT  = 0x17U, /*!<  64 Mbits (  8 MBytes = 2^(23)) */
  HAL_XSPI_CS_BOUNDARY_128MBIT = 0x18U, /*!< 128 Mbits ( 16 MBytes = 2^(24)) */
  HAL_XSPI_CS_BOUNDARY_256MBIT = 0x19U, /*!< 256 Mbits ( 32 MBytes = 2^(25)) */
  HAL_XSPI_CS_BOUNDARY_512MBIT = 0x1AU, /*!< 512 Mbits ( 64 MBytes = 2^(26)) */
  HAL_XSPI_CS_BOUNDARY_1GBIT   = 0x1BU, /*!<   1 Gbits (128 MBytes = 2^(27)) */
  HAL_XSPI_CS_BOUNDARY_2GBIT   = 0x1CU, /*!<   2 Gbits (256 MBytes = 2^(28)) */
  HAL_XSPI_CS_BOUNDARY_4GBIT   = 0x1DU, /*!<   4 Gbits (512 MBytes = 2^(29)) */
  HAL_XSPI_CS_BOUNDARY_8GBIT   = 0x1EU, /*!<   8 Gbits (  1 GBytes = 2^(30)) */
  HAL_XSPI_CS_BOUNDARY_16GBIT  = 0x1FU  /*!<  16 Gbits (  2 GBytes = 2^(31)) */
} hal_xspi_cs_boundary_t;
#endif /* XSPI_DCR3_CSBOUND */

/**
  * @brief HAL XSPI Delay Block Bypass enumeration definition.
  */
typedef enum
{
  HAL_XSPI_DLYB_ON     = 0U,                 /*!< Sampling clock is delayed by the delay block */
  HAL_XSPI_DLYB_BYPASS = XSPI_DCR1_DLYBYP    /*!< Delay block is bypassed                      */
} hal_xspi_dlyb_state_t;

/**
  * @brief HAL XSPI Memory Select enumeration definition.
  */
typedef enum
{
  HAL_XSPI_MEMORY_SELECTION_NCS1 = 0U,           /*!<  The output of nCS is nCS1       */
  HAL_XSPI_MEMORY_SELECTION_NCS2 = XSPI_CR_CSSEL /*!<  The output of nCS is nCS2       */
} hal_xspi_memory_selection_t;

/**
  * @brief HAL XSPI Operation Type enumeration definition.
  */
typedef enum
{
  HAL_XSPI_OPERATION_COMMON_CFG = 0x00U, /*!< Common configuration (indirect or auto-polling mode) */
  HAL_XSPI_OPERATION_READ_CFG   = 0x00U, /*!< Read configuration (memory-mapped mode)              */
#if defined(XSPI_WIR_INSTRUCTION)
  HAL_XSPI_OPERATION_WRITE_CFG  = 0x80U, /*!< Write configuration (memory-mapped mode)             */
#endif /* XSPI_WIR_INSTRUCTION */
#if defined(XSPI_DCR2_WRAPSIZE)
  HAL_XSPI_OPERATION_WRAP_CFG   = 0x40U  /*!< Wrap configuration (memory-mapped mode)              */
#endif /* XSPI_DCR2_WRAPSIZE */
} hal_xspi_operation_type_t;

/**
  * @brief HAL XSPI IO Select enumeration definition.
  */
typedef enum
{
  HAL_XSPI_IO_3_0   = 0U,                               /*!< Data exchanged over IO[3:0]   */
  HAL_XSPI_IO_7_4   = XSPI_CR_MSEL,                     /*!< Data exchanged over IO[7:4]   */
  HAL_XSPI_IO_7_0   = 0U                                /*!< Data exchanged over IO[7:0]   */
} hal_xspi_io_select_t;

/**
  * @brief HAL XSPI Instruction Mode enumeration definition.
  */
typedef enum
{
  HAL_XSPI_INSTRUCTION_NONE   = 0U,                                    /*!< No instruction               */
  HAL_XSPI_INSTRUCTION_1LINE  = XSPI_CCR_IMODE_0,                      /*!< Instruction on a single line */
  HAL_XSPI_INSTRUCTION_2LINES = XSPI_CCR_IMODE_1,                      /*!< Instruction on two lines     */
  HAL_XSPI_INSTRUCTION_4LINES = (XSPI_CCR_IMODE_0 | XSPI_CCR_IMODE_1), /*!< Instruction on four lines    */
  HAL_XSPI_INSTRUCTION_8LINES = XSPI_CCR_IMODE_2                       /*!< Instruction on eight lines   */
} hal_xspi_instruction_mode_t;

/**
  * @brief HAL XSPI Instruction Width enumeration definition.
  */
typedef enum
{
  HAL_XSPI_INSTRUCTION_8BIT  = 0U,               /*!< 8-bit instruction  */
  HAL_XSPI_INSTRUCTION_16BIT = XSPI_CCR_ISIZE_0, /*!< 16-bit instruction */
  HAL_XSPI_INSTRUCTION_24BIT = XSPI_CCR_ISIZE_1, /*!< 24-bit instruction */
  HAL_XSPI_INSTRUCTION_32BIT = XSPI_CCR_ISIZE    /*!< 32-bit instruction */
} hal_xspi_instruction_width_t;

/**
  * @brief HAL XSPI Instruction DTR Mode enumeration definition.
  */
typedef enum
{
  HAL_XSPI_INSTRUCTION_DTR_DISABLED = 0U,           /*!< DTR mode disabled for instruction phase */
  HAL_XSPI_INSTRUCTION_DTR_ENABLED  = XSPI_CCR_IDTR /*!< DTR mode enabled for instruction phase  */
} hal_xspi_instruction_dtr_status_t;

/**
  * @brief HAL XSPI Address Mode enumeration definition.
  */
typedef enum
{
  HAL_XSPI_ADDR_NONE    = 0U,                                      /*!< No address               */
  HAL_XSPI_ADDR_1LINE   = XSPI_CCR_ADMODE_0,                       /*!< Address on a single line */
  HAL_XSPI_ADDR_2LINES  = XSPI_CCR_ADMODE_1,                       /*!< Address on two lines     */
  HAL_XSPI_ADDR_4LINES  = (XSPI_CCR_ADMODE_0 | XSPI_CCR_ADMODE_1), /*!< Address on four lines    */
  HAL_XSPI_ADDR_8LINES  = XSPI_CCR_ADMODE_2                        /*!< Address on eight lines   */
} hal_xspi_addr_mode_t;

/**
  * @brief HAL XSPI Address width enumeration definition.
  */
typedef enum
{
  HAL_XSPI_ADDR_8BIT  = 0U,                /*!< 8-bit address  */
  HAL_XSPI_ADDR_16BIT = XSPI_CCR_ADSIZE_0, /*!< 16-bit address */
  HAL_XSPI_ADDR_24BIT = XSPI_CCR_ADSIZE_1, /*!< 24-bit address */
  HAL_XSPI_ADDR_32BIT = XSPI_CCR_ADSIZE    /*!< 32-bit address */
} hal_xspi_addr_width_t;

/**
  * @brief HAL XSPI Address DTR Mode enumeration definition.
  */
typedef enum
{
  HAL_XSPI_ADDR_DTR_DISABLED = 0U,            /*!< DTR mode disabled for address phase */
  HAL_XSPI_ADDR_DTR_ENABLED  = XSPI_CCR_ADDTR /*!< DTR mode enabled for address phase  */
} hal_xspi_addr_dtr_status_t;

/**
  * @brief HAL XSPI Alternate Bytes Mode enumeration definition.
  */
typedef enum
{
  HAL_XSPI_ALTERNATE_BYTES_NONE   = 0U,                                      /*!< No alternate bytes               */
  HAL_XSPI_ALTERNATE_BYTES_1LINE  = XSPI_CCR_ABMODE_0,                       /*!< Alternate bytes on a single line */
  HAL_XSPI_ALTERNATE_BYTES_2LINES = XSPI_CCR_ABMODE_1,                       /*!< Alternate bytes on two lines     */
  HAL_XSPI_ALTERNATE_BYTES_4LINES = (XSPI_CCR_ABMODE_0 | XSPI_CCR_ABMODE_1), /*!< Alternate bytes on four lines    */
  HAL_XSPI_ALTERNATE_BYTES_8LINES = XSPI_CCR_ABMODE_2                        /*!< Alternate bytes on eight lines   */
} hal_xspi_alternate_bytes_mode_t;

/**
  * @brief HAL XSPI Alternate Bytes Width enumeration definition.
  */
typedef enum
{
  HAL_XSPI_ALTERNATE_BYTES_8BIT  = 0U,                /*!< 8-bit alternate bytes  */
  HAL_XSPI_ALTERNATE_BYTES_16BIT = XSPI_CCR_ABSIZE_0, /*!< 16-bit alternate bytes */
  HAL_XSPI_ALTERNATE_BYTES_24BIT = XSPI_CCR_ABSIZE_1, /*!< 24-bit alternate bytes */
  HAL_XSPI_ALTERNATE_BYTES_32BIT = XSPI_CCR_ABSIZE    /*!< 32-bit alternate bytes */
} hal_xspi_alternate_bytes_width_t;

/**
  * @brief HAL XSPI Alternate Bytes DTR Mode enumeration definition.
  */
typedef enum
{
  HAL_XSPI_ALTERNATE_BYTES_DTR_DISABLED = 0U,            /*!< DTR mode disabled for alternate bytes phase */
  HAL_XSPI_ALTERNATE_BYTES_DTR_ENABLED  = XSPI_CCR_ABDTR /*!< DTR mode enabled for alternate bytes phase  */
} hal_xspi_alternate_bytes_dtr_status_t;

/**
  * @brief HAL XSPI Regular Data Mode enumeration definition.
  */
typedef enum
{
  HAL_XSPI_REGULAR_DATA_NONE     = 0U,                                   /*!< No data               */
  HAL_XSPI_REGULAR_DATA_1LINE   = XSPI_CCR_DMODE_0,                      /*!< Data on a single line */
  HAL_XSPI_REGULAR_DATA_2LINES  = XSPI_CCR_DMODE_1,                      /*!< Data on two lines     */
  HAL_XSPI_REGULAR_DATA_4LINES  = (XSPI_CCR_DMODE_0 | XSPI_CCR_DMODE_1), /*!< Data on four lines    */
  HAL_XSPI_REGULAR_DATA_8LINES  = XSPI_CCR_DMODE_2,                      /*!< Data on eight lines   */
} hal_xspi_regular_data_mode_t;

/**
  * @brief HAL XSPI Data DTR Mode enumeration definition.
  */
typedef enum
{
  HAL_XSPI_DATA_DTR_DISABLED = 0U,           /*!< DTR mode disabled for data phase */
  HAL_XSPI_DATA_DTR_ENABLED  = XSPI_CCR_DDTR /*!< DTR mode enabled for data phase  */
} hal_xspi_data_dtr_status_t;

/**
  * @brief HAL XSPI DQS Mode enumeration definition.
  */
typedef enum
{
  HAL_XSPI_DQS_DISABLED = 0U,           /*!< DQS disabled */
  HAL_XSPI_DQS_ENABLED  = XSPI_CCR_DQSE /*!< DQS enabled  */
} hal_xspi_dqs_status_t;

