MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.h
#if defined(USE_HAL_XSPI_HYPERBUS) && (USE_HAL_XSPI_HYPERBUS == 1U)
#if defined(XSPI_DCR1_MTYP_2)
/**
  * @brief HAL XSPI Hyperbus Write Zero Latency Activation enumeration definition.
  */
typedef enum
{
  HAL_XSPI_WRITE_ZERO_LATENCY_ENABLED  = 0U,           /*!< Latency on write accesses    */
  HAL_XSPI_WRITE_ZERO_LATENCY_DISABLED = XSPI_HLCR_WZL /*!< No latency on write accesses */
} hal_xspi_write_zero_latency_status_t;

/**
  * @brief HAL XSPI Hyperbus Latency Mode enumeration definition.
  */
typedef enum
{
  HAL_XSPI_LATENCY_VARIABLE = 0U,          /*!< Variable initial latency */
  HAL_XSPI_LATENCY_FIXED    = XSPI_HLCR_LM /*!< Fixed latency            */
} hal_xspi_latency_mode_t;

/**
  * @brief HAL XSPI Hyperbus Address Space enumeration definition.
  */
typedef enum
{
  HAL_XSPI_ADDR_MEMORY   = 0U,              /*!< HyperBus memory mode   */
  HAL_XSPI_ADDR_REGISTER = XSPI_DCR1_MTYP_0 /*!< HyperBus register mode */
} hal_xspi_addr_space_t;

/**
  * @brief HAL XSPI Hyperbus Data Mode enumeration definition.
  */
typedef enum
{
  HAL_XSPI_HYPERBUS_DATA_8LINES  = XSPI_CCR_DMODE_2,                     /*!< Data on eight lines   */
} hal_xspi_hyperbus_data_mode_t;
#endif /* XSPI_DCR1_MTYP_2 */
#endif /* USE_HAL_XSPI_HYPERBUS */

/**
  * @brief HAL XSPI Match Mode enumeration definition.
  */
#if defined(XSPI_SR_SMF)
typedef enum
{
  HAL_XSPI_MATCH_MODE_AND = 0U,         /*!< AND match mode between unmasked bits */
  HAL_XSPI_MATCH_MODE_OR  = XSPI_CR_PMM /*!< OR match mode between unmasked bits  */
} hal_xspi_match_mode_t;
#else
typedef enum
{
  HAL_XSPI_MATCH_MODE_AND = 0U,         /*!< AND match mode between unmasked bits */
  HAL_XSPI_MATCH_MODE_OR  = 1U          /*!< OR match mode between unmasked bits  */
} hal_xspi_match_mode_t;
#endif /* XSPI_SR_SMF */

/**
  * @brief HAL XSPI Automatic Stop enumeration definition.
  */
#if defined(XSPI_SR_SMF)
typedef enum
{
  HAL_XSPI_AUTOMATIC_STOP_DISABLED = 0U,          /*!< AutoPolling stops only with abort or XSPI disabling */
  HAL_XSPI_AUTOMATIC_STOP_ENABLED  = XSPI_CR_APMS /*!< AutoPolling stops as soon as there is a match       */
} hal_xspi_automatic_stop_status_t;
#else
typedef enum
{
  HAL_XSPI_AUTOMATIC_STOP_DISABLED = 0U,          /*!< AutoPolling stops only with abort or XSPI disabling */
  HAL_XSPI_AUTOMATIC_STOP_ENABLED  = 1U           /*!< AutoPolling stops as soon as there is a match       */
} hal_xspi_automatic_stop_status_t;
#endif /* XSPI_SR_SMF */

/**
  * @brief HAL XSPI Timeout Activation enumeration definition.
  */
typedef enum
{
  HAL_XSPI_TIMEOUT_DISABLE = 0U,          /*!< Timeout counter disabled, nCS remains active               */
  HAL_XSPI_TIMEOUT_ENABLE  = XSPI_CR_TCEN /*!< Timeout counter enabled, nCS released when timeout expires */
} hal_xspi_timeout_activation_t;


#if defined(USE_HAL_XSPI_HYPERBUS) && (USE_HAL_XSPI_HYPERBUS == 1U)
#if defined(XSPI_DCR1_MTYP_2)
/**
  * @brief HAL XSPI Hyperbus Configuration Structure definition.
  */
typedef struct
{
  uint32_t rw_recovery_time_cycle;                         /*!< It indicates the number of cycles for the device
                                                                recovery time.
                                                                This parameter can be a value between 0 and 255.  */
  uint32_t access_time_cycle;                              /*!< It indicates the number of cycles for the device access
                                                                time.
                                                                This parameter can be a value between 0 and 255.  */
  hal_xspi_write_zero_latency_status_t write_zero_latency; /*!< It enables or disables the latency for the write access. */
  hal_xspi_latency_mode_t latency_mode;                    /*!< It configures the latency mode.                   */
} hal_xspi_hyperbus_config_t;
#endif /* XSPI_DCR1_MTYP_2 */
#endif /* USE_HAL_XSPI_HYPERBUS */

/**
  * @brief HAL XSPI Timing Config structure definition.
  */
typedef struct
{
  uint32_t clk_prescaler;              /*!< It specifies the prescaler factor used for generating
                                            the external clock based on the kernel clock.
                                            This parameter can be a value between 0 and 255.
                                            Choosing a prescaler value of N means dividing the clock by N+1.     */
  hal_xspi_sample_shift_t shift;       /*!< It allows delaying the data sampling by 1/2 cycle to
                                            take into account external signal delays.             */
  hal_xspi_delay_hold_t hold;          /*!< It allows holding the data for 1/4 cycle.             */
  uint32_t cs_high_time_cycle;         /*!< It defines the minimum number of clocks which the chip
                                            select must remain high between commands.
                                            This parameter can be a value between 1 and 64.       */
#if defined(XSPI_DCR4_REFRESH)
  uint32_t cs_refresh_time_cycle;      /*!< It enables the refresh rate feature. The chip select is
                                            released every Refresh+1 clock cycles.
                                            This parameter can be a value between 0 and 0xFFFFFFFF. */
#endif /* XSPI_DCR4_REFRESH */
  hal_xspi_dlyb_state_t dlyb_state;    /*!< It enables the delay block bypass, so the sampling is
                                            not affected by the delay block.                      */
} hal_xspi_timing_config_t;

/**
  * @brief HAL XSPI Memory Configuration structure definition.
  */
typedef struct
{
  hal_xspi_memory_mode_t mode;              /*!< It specifies the memory mode.                                    */

  hal_xspi_memory_type_t type;              /*!< It indicates the external device type connected to the XSPI.     */

  hal_xspi_memory_size_t size_bit;          /*!< It defines the size of the external device connected to the XSPI.
                                                 It corresponds to the number of address bits required to access
                                                 the external device.                                             */

#if defined(XSPI_DCR2_WRAPSIZE)
  hal_xspi_wrap_size_t wrap_size_byte;      /*!< It indicates the wrap-size corresponding to the external device. */
#endif /* XSPI_DCR2_WRAPSIZE */

#if defined(XSPI_DCR3_CSBOUND)
  hal_xspi_cs_boundary_t cs_boundary;       /*!< It enables the transaction boundary feature and
                                                 defines the boundary of bytes to release the chip select.       */
#endif /* XSPI_DCR3_CSBOUND */
} hal_xspi_memory_config_t;

/**
  * @brief HAL XSPI Global Configuration structure definition.
  */
typedef struct
{
  hal_xspi_memory_config_t memory;     /*!< It specifies the XSPI memory configuration structure definition */

  hal_xspi_timing_config_t timing;     /*!< It specifies the XSPI timing configuration structure definition */

#if defined(USE_HAL_XSPI_HYPERBUS) && (USE_HAL_XSPI_HYPERBUS == 1U)
#if defined(XSPI_DCR1_MTYP_2)
  hal_xspi_hyperbus_config_t hyperbus; /*!< It specifies the XSPI Hyperbus configuration structure definition */
#endif /* XSPI_DCR1_MTYP_2 */
#endif /* USE_HAL_XSPI_HYPERBUS */
} hal_xspi_config_t;

/**
  * @brief HAL XSPI Auto Polling mode configuration structure definition.
  */
typedef struct
{
  uint32_t match_value;                                   /*!< Specifies the value to be compared with the masked status
                                                               register. This parameter can be any value between
                                                               0 and 0xFFFFFFFFU.                                   */
  uint32_t match_mask;                                    /*!< Specifies the mask to be applied to the status bytes
                                                               received. This parameter can be any value between
                                                               0 and 0xFFFFFFFFU.                                   */
  hal_xspi_match_mode_t match_mode;                       /*!< Specifies the method used for determining a match.   */

