MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.h
  hal_xspi_automatic_stop_status_t automatic_stop_status; /*!< Specifies whether automatic polling is stopped after a
                                                               match.                                               */
  uint32_t interval_cycle;                                /*!< Specifies the number of clock cycles between two reads
                                                               during automatic polling phases.
                                                               This parameter can be any value between 0 and 0xFFFF. */
} hal_xspi_auto_polling_config_t;

/**
  * @brief HAL XSPI Regular Command Structure definition.
  */
typedef struct
{
  hal_xspi_operation_type_t operation_type;                              /*!< It indicates whether the configuration applies
                                                                              to the common registers or
                                                                              to the registers for the write operation
                                                                              (these registers are only used for
                                                                               memory-mapped mode).                  */
  hal_xspi_io_select_t  io_select;                                       /*!< It indicates the I/Os used to exchange
                                                                              data with external memory.             */

  uint32_t instruction;                                                  /*!< It contains the instruction to be sent to
                                                                              the device.
                                                                              This parameter can be a value between
                                                                              0 and 0xFFFFFFFFU.                     */
  hal_xspi_instruction_mode_t instruction_mode;                          /*!< It indicates the instruction mode.     */

  hal_xspi_instruction_width_t instruction_width;                        /*!< It indicates the width of the
                                                                              instruction.                           */

  hal_xspi_instruction_dtr_status_t instruction_dtr_mode_status;         /*!< It enables or disables the DTR mode for the
                                                                              instruction phase.                     */

  uint32_t addr;                                                         /*!< It contains the address to be sent to the
                                                                              device.
                                                                              This parameter can be a value between
                                                                              0 and 0xFFFFFFFF.                      */
  hal_xspi_addr_mode_t addr_mode;                                        /*!< It indicates the address mode. Address
                                                                              mode specifies the number of lines
                                                                              for address (except no address).       */
  hal_xspi_addr_width_t addr_width;                                      /*!< It indicates the width of the address. */

  hal_xspi_addr_dtr_status_t addr_dtr_mode_status;                       /*!< It enables or disables the DTR mode for the
                                                                              address phase.                         */

  uint32_t alternate_bytes;                                              /*!< It contains the alternate bytes to be sent
                                                                              to the device.
                                                                              This parameter can be a value between
                                                                              0 and 0xFFFFFFFF.                      */
  hal_xspi_alternate_bytes_mode_t alternate_bytes_mode;                  /*!< It indicates the mode of the alternate
                                                                              bytes.                                 */

  hal_xspi_alternate_bytes_width_t alternate_bytes_width;                /*!< It indicates the width of the alternate
                                                                              bytes.                                 */

  hal_xspi_alternate_bytes_dtr_status_t alternate_bytes_dtr_mode_status; /*!< It enables or disables the DTR mode for the
                                                                              alternate bytes phase.                 */

  hal_xspi_regular_data_mode_t data_mode;                                /*!< It indicates the data mode. Data mode
                                                                              specifies the number of lines
                                                                              for data exchange (except no data).    */
  hal_xspi_data_dtr_status_t data_dtr_mode_status;                       /*!< It enables or disables the DTR mode for the
                                                                              data phase.                            */

  uint32_t dummy_cycle;                                                  /*!< It indicates the number of dummy cycles
                                                                              inserted before data phase.
                                                                              This parameter can be a value between
                                                                              0 and 31U. */
  hal_xspi_dqs_status_t dqs_mode_status;                                 /*!< It enables or disables the data strobe
                                                                              management.                            */
  uint32_t size_byte;                                                    /*!< It indicates the number of data
                                                                              transferred with this command.
                                                                              This field is only used for indirect mode.
                                                                              This parameter can be a value between
                                                                              1 and 0xFFFFFFFFU.                     */
} hal_xspi_regular_cmd_t;

#if defined(USE_HAL_XSPI_HYPERBUS) && (USE_HAL_XSPI_HYPERBUS == 1U)
#if defined(XSPI_DCR1_MTYP_2)
/**
  * @brief HAL XSPI Hyperbus Command Structure definition.
  */
typedef struct
{
  hal_xspi_addr_space_t         addr_space;      /*!< It indicates the address space accessed by the command. */

  uint32_t                      addr;            /*!< It contains the address to be sent to the device.
                                                      This parameter can be a value between 0 and 0xFFFFFFFF. */
  hal_xspi_addr_width_t         addr_width;      /*!< It indicates the width of the address.                */

