MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.h
  uint32_t                      size_byte;       /*!< It indicates the number of data transferred with this command.
                                                      This field is only used for indirect mode.
                                                      This parameter can be a value between 1 and 0xFFFFFFFF. */
  hal_xspi_dqs_status_t         dqs_mode_status; /*!< It enables or disables the data strobe management.    */

  hal_xspi_hyperbus_data_mode_t data_mode;       /*!< It indicates the data mode. Data mode specifies the number of lines for
                                                      data exchange (except no data).                       */
} hal_xspi_hyperbus_cmd_t;
#endif /* XSPI_DCR1_MTYP_2 */
#endif /* USE_HAL_XSPI_HYPERBUS */

/**
  * @brief HAL XSPI Memory Mapped mode configuration structure definition.
  */
typedef struct
{
  hal_xspi_timeout_activation_t timeout_activation; /*!< Specifies if the timeout counter is enabled to release the chip
                                                         select.                                              */

  uint32_t timeout_period_cycle;                    /*!< Specifies the number of clock cycles to wait when the FIFO is full
                                                         before releasing the chip select.
                                                         This parameter can be any value between 0 and 0xFFFF. */
} hal_xspi_memory_mapped_config_t;


typedef struct hal_xspi_handle_s hal_xspi_handle_t;/*!< XSPI Handle Structure type */

#if defined(USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
typedef void (*hal_xspi_cb_t)(hal_xspi_handle_t *hxspi);/*!< XSPI Callback pointer definition */
#endif /* USE_HAL_XSPI_REGISTER_CALLBACKS */

/**
  * @brief HAL XSPI handle Structure definition.
  */
struct hal_xspi_handle_s
{
  hal_xspi_t                instance;       /*!< XSPI registers base address                 */

  volatile hal_xspi_state_t global_state;   /*!< Internal state of the XSPI HAL driver       */


  uint8_t                   *p_buffer;      /*!< Address of the XSPI buffer for transfer     */

  volatile uint32_t         xfer_size;      /*!< Number of data to transfer                  */

  volatile uint32_t         xfer_count;     /*!< Counter of data transferred                 */

  hal_xspi_memory_mode_t    mode;           /*!< Specifies the memory mode                   */

  hal_xspi_delay_hold_t     hold;           /*!< It allows holding the data for 1/4 cycle    */

  hal_xspi_memory_type_t    type;           /*!< Indicates the external device type          */

  uint32_t                  fifo_threshold; /*!< Specifies the FIFO configuration value      */

#if defined(USE_HAL_XSPI_DMA) && (USE_HAL_XSPI_DMA == 1U)
  uint32_t                  is_dma_error;   /*!< Indicates an error occurs in DMA mode       */

  hal_dma_handle_t          *hdma_tx;       /*!< Handle of the DMA channel used for transmit */

  hal_dma_handle_t          *hdma_rx;       /*!< Handle of the DMA channel used for receive  */
#endif /* USE_HAL_XSPI_DMA */

#if defined(USE_HAL_XSPI_USER_DATA) && (USE_HAL_XSPI_USER_DATA == 1U)
  const void                *p_user_data;   /*!< User Data Pointer                           */
#endif /* USE_HAL_XSPI_USER_DATA */

#if defined(USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
  hal_xspi_cb_t p_error_cb;                 /*!< XSPI error callback                         */
  hal_xspi_cb_t p_abort_cplt_cb;            /*!< XSPI abort callback                         */
  hal_xspi_cb_t p_fifo_threshold_cb;        /*!< XSPI FIFO threshold callback                */
  hal_xspi_cb_t p_cmd_cplt_cb;              /*!< XSPI command complete callback              */
  hal_xspi_cb_t p_rx_cplt_cb;               /*!< XSPI receive complete callback              */
  hal_xspi_cb_t p_tx_cplt_cb;               /*!< XSPI transfer complete callback             */
  hal_xspi_cb_t p_rx_half_cplt_cb;          /*!< XSPI half receive complete callback         */
  hal_xspi_cb_t p_tx_half_cplt_cb;          /*!< XSPI half transfer complete callback        */
  hal_xspi_cb_t p_status_match_cb;          /*!< XSPI status match callback                  */
#endif /* USE_HAL_XSPI_REGISTER_CALLBACKS */

#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
  /* in case of single process at a time: one single variable storing the last errors */
  volatile uint32_t last_error_codes;       /*!< XSPI error codes                            */
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */
};

/**
  * @}
  */

/* Exported functions ---------------------------------------------------------*/
/** @defgroup XSPI_Exported_Functions HAL XSPI Functions
  * @{
  */

/** @defgroup XSPI_Exported_Functions_Group1 Initialization and deinitialization functions
  * @{
  */
hal_status_t HAL_XSPI_Init(hal_xspi_handle_t *hxspi, hal_xspi_t instance);
void         HAL_XSPI_DeInit(hal_xspi_handle_t *hxspi);
/**
  * @}
  */

/** @defgroup XSPI_Exported_Functions_Group2 XSPI Configuration functions
  * @{
  */
hal_status_t HAL_XSPI_SetConfig(hal_xspi_handle_t *hxspi, const hal_xspi_config_t *p_config);
void         HAL_XSPI_GetConfig(hal_xspi_handle_t *hxspi, hal_xspi_config_t *p_config);
hal_status_t HAL_XSPI_SetFifoThreshold(hal_xspi_handle_t *hxspi, uint32_t threshold);
uint32_t     HAL_XSPI_GetFifoThreshold(const hal_xspi_handle_t *hxspi);
hal_status_t HAL_XSPI_SetPrescaler(hal_xspi_handle_t *hxspi, uint32_t clk_prescaler);
uint32_t     HAL_XSPI_GetPrescaler(const hal_xspi_handle_t *hxspi);
hal_status_t           HAL_XSPI_SetMemorySize(hal_xspi_handle_t *hxspi, hal_xspi_memory_size_t size);
hal_xspi_memory_size_t HAL_XSPI_GetMemorySize(const hal_xspi_handle_t *hxspi);
hal_status_t           HAL_XSPI_SetMemoryType(hal_xspi_handle_t *hxspi, hal_xspi_memory_type_t type);
hal_xspi_memory_type_t HAL_XSPI_GetMemoryType(const hal_xspi_handle_t *hxspi);
hal_status_t                HAL_XSPI_SetMemorySelection(hal_xspi_handle_t *hxspi, hal_xspi_memory_selection_t select);
hal_xspi_memory_selection_t HAL_XSPI_GetMemorySelection(const hal_xspi_handle_t *hxspi);
uint32_t HAL_XSPI_GetMemoryMappedBaseAddress(const hal_xspi_handle_t *hxspi);
hal_status_t HAL_XSPI_EnableFreeRunningClock(hal_xspi_handle_t *hxspi);
hal_status_t HAL_XSPI_DisableFreeRunningClock(hal_xspi_handle_t *hxspi);
hal_xspi_free_running_clk_status_t HAL_XSPI_IsEnabledFreeRunningClock(const hal_xspi_handle_t *hxspi);
hal_status_t HAL_XSPI_EnablePrefetchData(hal_xspi_handle_t *hxspi);
hal_status_t HAL_XSPI_DisablePrefetchData(hal_xspi_handle_t *hxspi);
hal_xspi_prefetch_data_status_t HAL_XSPI_IsEnabledPrefetchData(const hal_xspi_handle_t *hxspi);
/**
  * @}
  */

