MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.h
/** @defgroup XSPI_Exported_Functions_Group3 XSPI Command and I/O operation functions
  * @{
  */
hal_status_t HAL_XSPI_StartMemoryMappedMode(hal_xspi_handle_t *hxspi, const hal_xspi_memory_mapped_config_t *p_config);
hal_status_t HAL_XSPI_StopMemoryMappedMode(hal_xspi_handle_t *hxspi);

/* XSPI command configuration functions */
hal_status_t HAL_XSPI_SendRegularCmd(hal_xspi_handle_t *hxspi, const hal_xspi_regular_cmd_t *p_cmd,
                                     uint32_t timeout_ms);
hal_status_t HAL_XSPI_SendRegularCmd_IT(hal_xspi_handle_t *hxspi, const hal_xspi_regular_cmd_t *p_cmd);

#if defined(USE_HAL_XSPI_HYPERBUS) && (USE_HAL_XSPI_HYPERBUS == 1U)
#if defined(XSPI_DCR1_MTYP_2)
hal_status_t HAL_XSPI_SendHyperbusCmd(hal_xspi_handle_t *hxspi, const hal_xspi_hyperbus_cmd_t *p_cmd,
                                      uint32_t timeout_ms);
#endif /* XSPI_DCR1_MTYP_2 */
#endif /* USE_HAL_XSPI_HYPERBUS */

hal_status_t HAL_XSPI_ExecRegularAutoPoll(hal_xspi_handle_t *hxspi, const hal_xspi_auto_polling_config_t *p_config,
                                          uint32_t timeout_ms);
#if defined(XSPI_SR_SMF)
hal_status_t HAL_XSPI_ExecRegularAutoPoll_IT(hal_xspi_handle_t *hxspi, const hal_xspi_auto_polling_config_t *p_config);
#endif /* XSPI_SR_SMF */

/* IO operation functions */
hal_status_t HAL_XSPI_Transmit(hal_xspi_handle_t *hxspi, const void *p_data, uint32_t timeout_ms);
hal_status_t HAL_XSPI_Receive(hal_xspi_handle_t *hxspi, void *p_data, uint32_t timeout_ms);
hal_status_t HAL_XSPI_Transmit_IT(hal_xspi_handle_t *hxspi, const void *p_data);
hal_status_t HAL_XSPI_Receive_IT(hal_xspi_handle_t *hxspi, void *p_data);
#if defined(USE_HAL_XSPI_DMA) && (USE_HAL_XSPI_DMA == 1U)
hal_status_t HAL_XSPI_Transmit_DMA(hal_xspi_handle_t *hxspi, const void *p_data);
hal_status_t HAL_XSPI_Receive_DMA(hal_xspi_handle_t *hxspi, void *p_data);
hal_status_t HAL_XSPI_Transmit_DMA_Opt(hal_xspi_handle_t *hxspi, const void *p_data, uint32_t interrupts);
hal_status_t HAL_XSPI_Receive_DMA_Opt(hal_xspi_handle_t *hxspi, void *p_data, uint32_t interrupts);
#endif /* USE_HAL_XSPI_DMA */
hal_status_t HAL_XSPI_Abort(hal_xspi_handle_t *hxspi, uint32_t timeout_ms);
hal_status_t HAL_XSPI_Abort_IT(hal_xspi_handle_t *hxspi);
/**
  * @}
  */

/** @defgroup XSPI_Exported_Functions_Group4 IRQHandler, link DMA, and callback functions
  * @{
  */
void HAL_XSPI_IRQHandler(hal_xspi_handle_t *hxspi);
/* Callback functions in non-blocking modes */
void HAL_XSPI_ErrorCallback(hal_xspi_handle_t *hxspi);
void HAL_XSPI_AbortCpltCallback(hal_xspi_handle_t *hxspi);
void HAL_XSPI_FifoThresholdCallback(hal_xspi_handle_t *hxspi);
void HAL_XSPI_CmdCpltCallback(hal_xspi_handle_t *hxspi);
void HAL_XSPI_RxCpltCallback(hal_xspi_handle_t *hxspi);
void HAL_XSPI_TxCpltCallback(hal_xspi_handle_t *hxspi);
void HAL_XSPI_RxHalfCpltCallback(hal_xspi_handle_t *hxspi);
void HAL_XSPI_TxHalfCpltCallback(hal_xspi_handle_t *hxspi);
void HAL_XSPI_StatusMatchCallback(hal_xspi_handle_t *hxspi);
#if defined(USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
/* XSPI callback registration */
hal_status_t HAL_XSPI_RegisterErrorCallback(hal_xspi_handle_t *hxspi, hal_xspi_cb_t p_callback);
hal_status_t HAL_XSPI_RegisterCmdCpltCallback(hal_xspi_handle_t *hxspi, hal_xspi_cb_t p_callback);
hal_status_t HAL_XSPI_RegisterRxCpltCallback(hal_xspi_handle_t *hxspi, hal_xspi_cb_t p_callback);
hal_status_t HAL_XSPI_RegisterTxCpltCallback(hal_xspi_handle_t *hxspi, hal_xspi_cb_t p_callback);
hal_status_t HAL_XSPI_RegisterRxHalfCpltCallback(hal_xspi_handle_t *hxspi, hal_xspi_cb_t p_callback);
hal_status_t HAL_XSPI_RegisterTxHalfCpltCallback(hal_xspi_handle_t *hxspi, hal_xspi_cb_t p_callback);
#if defined(XSPI_SR_SMF)
hal_status_t HAL_XSPI_RegisterStatusMatchCallback(hal_xspi_handle_t *hxspi, hal_xspi_cb_t p_callback);
#endif /* XSPI_SR_SMF */
hal_status_t HAL_XSPI_RegisterAbortCpltCallback(hal_xspi_handle_t *hxspi, hal_xspi_cb_t p_callback);
hal_status_t HAL_XSPI_RegisterFifoThresholdCallback(hal_xspi_handle_t *hxspi, hal_xspi_cb_t p_callback);
#endif /* USE_HAL_XSPI_REGISTER_CALLBACKS */
#if defined(USE_HAL_XSPI_USER_DATA) && (USE_HAL_XSPI_USER_DATA == 1U)
void HAL_XSPI_SetUserData(hal_xspi_handle_t *hxspi, const void *p_user_data);
const void *HAL_XSPI_GetUserData(const hal_xspi_handle_t *hxspi);
#endif /* USE_HAL_XSPI_USER_DATA */
#if defined(USE_HAL_XSPI_DMA) && (USE_HAL_XSPI_DMA == 1U)
hal_status_t HAL_XSPI_SetTxDMA(hal_xspi_handle_t *hxspi, hal_dma_handle_t *hdma_tx);
hal_status_t HAL_XSPI_SetRxDMA(hal_xspi_handle_t *hxspi, hal_dma_handle_t *hdma_rx);
#endif /* USE_HAL_XSPI_DMA */
/**
  * @}
  */

/** @defgroup XSPI_Exported_Functions_Group5 Peripheral current frequency, state and errors functions
  * @{
  */
uint32_t         HAL_XSPI_GetClockFreq(const hal_xspi_handle_t *hxspi);
hal_xspi_state_t HAL_XSPI_GetState(const hal_xspi_handle_t *hxspi);
#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
uint32_t         HAL_XSPI_GetLastErrorCodes(const hal_xspi_handle_t *hxspi);
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */
/**
  * @}
  */

/** @defgroup XSPI_Exported_Functions_Group6 XSPI Delay Block functions
  * @{
  */
hal_status_t HAL_XSPI_DLYB_SetConfigDelay(hal_xspi_handle_t *hxspi, uint32_t clock_phase_value);
hal_status_t HAL_XSPI_DLYB_GetConfigDelay(const hal_xspi_handle_t *hxspi, uint32_t *p_clock_phase);
hal_status_t HAL_XSPI_DLYB_CalculateMaxClockPhase(hal_xspi_handle_t *hxspi, uint32_t *p_max_clock_phase);
hal_status_t HAL_XSPI_DLYB_Enable(hal_xspi_handle_t *hxspi);
hal_status_t HAL_XSPI_DLYB_Disable(hal_xspi_handle_t *hxspi);
hal_xspi_dlyb_status_t HAL_XSPI_DLYB_IsEnabled(const hal_xspi_handle_t *hxspi);
/**
  * @}
  */


/** @addtogroup XSPI_Exported_Functions_Group9 Interrupt functions
  * @{
  */
/** @brief  Enable the specified XSPI interrupt.
  * @param  hxspi specifies the XSPI Handle.
  * @param  it_source specifies the XSPI interrupt source to enable
  *         This parameter can be any combination of the following values:
  *            @arg HAL_XSPI_IT_TO:  XSPI Timeout interrupt
  *            @arg HAL_XSPI_IT_SM:  XSPI Status match interrupt
  *            @arg HAL_XSPI_IT_FT:  XSPI FIFO threshold interrupt
  *            @arg HAL_XSPI_IT_TC:  XSPI Transfer complete interrupt
  *            @arg HAL_XSPI_IT_TE:  XSPI Transfer error interrupt
  *            @arg HAL_XSPI_IT_ALL: XSPI All interrupts
  */
__STATIC_INLINE void HAL_XSPI_EnableIT(hal_xspi_handle_t *hxspi, uint32_t it_source)
{
  STM32_SET_BIT(((XSPI_TypeDef *)((uint32_t) hxspi->instance))->CR, it_source);
}

/** @brief  Disable the specified XSPI interrupt.
  * @param  hxspi specifies the XSPI Handle.
  * @param  it_source specifies the XSPI interrupt source to disable
  *         This parameter can be any combination of the following values:
  *            @arg HAL_XSPI_IT_TO: XSPI Timeout interrupt
  *            @arg HAL_XSPI_IT_SM: XSPI Status match interrupt
  *            @arg HAL_XSPI_IT_FT: XSPI FIFO threshold interrupt
  *            @arg HAL_XSPI_IT_TC: XSPI Transfer complete interrupt
  *            @arg HAL_XSPI_IT_TE: XSPI Transfer error interrupt
  *            @arg HAL_XSPI_IT_ALL: XSPI All interrupts
  */
__STATIC_INLINE void HAL_XSPI_DisableIT(hal_xspi_handle_t *hxspi, uint32_t it_source)
{
  STM32_CLEAR_BIT(((XSPI_TypeDef *)((uint32_t) hxspi->instance))->CR, it_source);
}

