MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.h
/** @brief  Check whether the specified XSPI interrupt source is enabled or not.
  * @param  hxspi specifies the XSPI Handle.
  * @param  it_source specifies the XSPI interrupt source to check
  *         This parameter can be one of the following values:
  *            @arg HAL_XSPI_IT_TO: XSPI Timeout interrupt
  *            @arg HAL_XSPI_IT_SM: XSPI Status match interrupt
  *            @arg HAL_XSPI_IT_FT: XSPI FIFO threshold interrupt
  *            @arg HAL_XSPI_IT_TC: XSPI Transfer complete interrupt
  *            @arg HAL_XSPI_IT_TE: XSPI Transfer error interrupt
  * @return retrieve the state of the selected XSPI interrupt.
  */
__STATIC_INLINE uint32_t HAL_XSPI_IsEnabledIT(const hal_xspi_handle_t *hxspi, uint32_t it_source)
{
  return ((STM32_READ_BIT(((XSPI_TypeDef *)((uint32_t) hxspi->instance))->CR,
                          it_source) == it_source) ? 1U : 0U);
}

/**
  * @brief  Check whether the selected XSPI flag is set or not.
  * @param  hxspi specifies the XSPI Handle.
  * @param  flag specifies the XSPI flag to check
  *         This parameter can be one of the following values:
  *            @arg HAL_XSPI_FLAG_BUSY: XSPI Busy flag
  *            @arg HAL_XSPI_FLAG_TO:   XSPI Timeout flag
  *            @arg HAL_XSPI_FLAG_SM:   XSPI Status match flag
  *            @arg HAL_XSPI_FLAG_FT:   XSPI FIFO threshold flag
  *            @arg HAL_XSPI_FLAG_TC:   XSPI Transfer complete flag
  *            @arg HAL_XSPI_FLAG_TE:   XSPI Transfer error flag
  * @return retrieve the state of the selected XSPI flag.
  */
__STATIC_INLINE hal_xspi_flag_status_t HAL_XSPI_IsActiveFlag(const hal_xspi_handle_t *hxspi, uint32_t flag)
{
  return ((STM32_READ_BIT(((XSPI_TypeDef *)((uint32_t) hxspi->instance))->SR, flag) != 0U) ? HAL_XSPI_FLAG_ACTIVE \
          : HAL_XSPI_FLAG_NOT_ACTIVE);
}

/** @brief  Clears the specified XSPI's flag status.
  * @param  hxspi specifies the XSPI Handle.
  * @param  flag specifies the XSPI clear register flag that needs to be set
  *         This parameter can be any combination of the following values:
  *            @arg HAL_XSPI_FLAG_TO:   XSPI Timeout flag
  *            @arg HAL_XSPI_FLAG_SM:   XSPI Status match flag
  *            @arg HAL_XSPI_FLAG_TC:   XSPI Transfer complete flag
  *            @arg HAL_XSPI_FLAG_TE:   XSPI Transfer error flag
  *            @arg HAL_XSPI_FLAG_ALL:  XSPI All flags
  */
__STATIC_INLINE void HAL_XSPI_ClearFlag(hal_xspi_handle_t *hxspi, uint32_t flag)
{
  STM32_WRITE_REG(((XSPI_TypeDef *)((uint32_t) hxspi->instance))->FCR, flag);
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#endif /* XSPI1 */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32C5XX_HAL_XSPI_H */
